clear all
close all


disp('======= reset');
A=zeros(3,1)
A(:)=1:3
% %disp('Error: 拡大はされない');
%A(:)=1:4
A(1:4)=1:4
A(5)=5
A(:,2)=2
A(:,3)=1:5
% %disp('Error: 拡大はされない');
%A(:,4)=1:6
A(:,:,2)=5


disp('======= 1次元配列として取り扱う．');
A(:)=1:numel(A)
A(1:2:end)=0
%disp('Error: 拡大はされない');
%A(1:3:end+3)=2;

disp('======= 2次元配列として取り扱う．');
A(:,5)=ones(3,1)
%disp('Error: 拡大はされない');
%A(:,9)=ones(3,1)

disp('======= 3次元配列として取り扱う．');
A(:,5,1)=ones(3,1)*2
A(:,6,1)=ones(3,1)*3

%disp('Error: 拡大はされない');
%A(:,7,1)=ones(4,1)*3
